presentation.org
* C++20 ~std::apply~

How about immediately-invoking a lambda?

#+begin_src c++
template <class F, class Tuple>
constexpr decltype(auto) apply(F&& f, Tuple&& t)
{
  return [&] <auto... Is> (std::index_sequence<Is...>) {
      return std::invoke(std::forward<F>(f),
                         std::get<Is>(std::forward<Tuple>(t))...);
  }(std::make_index_sequence<std::tuple_size_v<std::remove_reference_t<Tuple>>>{});
}
#+end_src

A familiar template syntax immediately-invoked lambda expression (FTSIILE).

* Another example: for_each on tuples

Here's a simple unary for_each on tuples, using ~std::apply~.

#+begin_src c++
template <class Tuple, class F>
F for_each(Tuple&& t, F&& f) {
  return std::apply(
    [&] <class... Ts> (Ts&&...ts) { (f(std::forward<Ts>(ts)), ...); },
    std::forward<Tuple>(t)), f;
}
#+end_src

But it gets trickier if we want a binary function over 2 tuples,\\
or an n-ary function over multiple tuples.

* Another example: for_each on tuples

Adapted from fluentcpp.com's [[https://www.fluentcpp.com/2019/03/08/stl-algorithms-on-tuples/]["STL algorithms on Tuples"]]

#+begin_src c++
template <class Tuple1, class Tuple2, class F, std::size_t... Is>
F for_each_impl(Tuple1&& t1, Tuple2&& t2, F&& f, std::index_sequence<Is...>)
{
  return (std::invoke(f, std::get<Is>(std::forward<Tuple1>(t1)),
                         std::get<Is>(std::forward<Tuple2>(t2))), ...), f;
}

template <class Tuple1, class Tuple2, class F>
constexpr decltype(auto) for_each(Tuple1&& t1, Tuple2&& t2, F&& f)
{
  return for_each_impl(std::forward<Tuple1>(t1), std::forward<Tuple2>(t2),
                       std::forward<F>(f),
                       std::make_index_sequence<std::tuple_size<
                         std::remove_reference_t<Tuple1>>::value>{});
}
#+end_src

