presentation.html
<section>
<section id="slide-org5a10f33">
<h2 id="org5a10f33">C++20 <code>std::apply</code></h2>
<p>
How about immediately-invoking a lambda?
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">F</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple</span><span style="color: #2aa198;">&gt;</span>
<span style="color: #b58900; font-weight: bold;">constexpr</span> <span style="color: #b58900; font-weight: bold;">decltype</span><span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">auto</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">apply</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">F</span>&amp;&amp; <span style="color: #cb4b16;">f</span>, <span style="color: #268bd2;">Tuple</span>&amp;&amp; <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
  <span style="color: #b58900; font-weight: bold;">return</span> <span style="color: #b58900;">[</span>&amp;<span style="color: #b58900;">]</span> <span style="color: #b58900;">&lt;</span><span style="color: #b58900; font-weight: bold;">auto</span><span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">Is</span><span style="color: #b58900;">&gt;</span> <span style="color: #b58900;">(</span><span style="color: #859900;">std</span>::<span style="color: #268bd2;">index_sequence</span><span style="color: #94BFF3;">&lt;</span>Is<span style="color: #2aa198;">...</span><span style="color: #94BFF3;">&gt;</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
      <span style="color: #b58900; font-weight: bold;">return</span> <span style="color: #859900;">std</span>::invoke<span style="color: #94BFF3;">(</span><span style="color: #859900;">std</span>::forward<span style="color: #dc322f;">&lt;</span><span style="color: #268bd2;">F</span><span style="color: #dc322f;">&gt;(</span>f<span style="color: #dc322f;">)</span>,
                         <span style="color: #859900;">std</span>::get<span style="color: #dc322f;">&lt;</span>Is<span style="color: #dc322f;">&gt;(</span><span style="color: #859900;">std</span>::forward<span style="color: #859900;">&lt;</span><span style="color: #268bd2;">Tuple</span><span style="color: #859900;">&gt;(</span>t<span style="color: #859900;">)</span><span style="color: #dc322f;">)</span><span style="color: #2aa198;">...</span><span style="color: #94BFF3;">)</span>;
  <span style="color: #b58900;">}(</span><span style="color: #859900;">std</span>::<span style="color: #268bd2;">make_index_sequence</span><span style="color: #94BFF3;">&lt;</span><span style="color: #859900;">std</span>::<span style="color: #268bd2;">tuple_size_v</span><span style="color: #dc322f;">&lt;</span><span style="color: #859900;">std</span>::<span style="color: #268bd2;">remove_reference_t</span><span style="color: #859900;">&lt;</span><span style="color: #268bd2;">Tuple</span><span style="color: #859900;">&gt;</span><span style="color: #dc322f;">&gt;</span><span style="color: #94BFF3;">&gt;{}</span><span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>
</pre>
</div>

<p>
A familiar template syntax immediately-invoked lambda expression (FTSIILE).
</p>

</section>
</section>
<section>
<section id="slide-org1c2f4b9">
<h2 id="org1c2f4b9">Another example: for_each on tuples</h2>
<p>
Here's a simple unary for_each on tuples, using <code>std::apply</code>.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">F</span><span style="color: #2aa198;">&gt;</span>
<span style="color: #268bd2;">F</span> <span style="color: #2aa198;">for_each</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">Tuple</span>&amp;&amp; <span style="color: #cb4b16;">t</span>, <span style="color: #268bd2;">F</span>&amp;&amp; <span style="color: #cb4b16;">f</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
  <span style="color: #b58900; font-weight: bold;">return</span> <span style="color: #859900;">std</span>::apply<span style="color: #b58900;">(</span>
    <span style="color: #94BFF3;">[</span>&amp;<span style="color: #94BFF3;">]</span> <span style="color: #94BFF3;">&lt;</span><span style="color: #b58900; font-weight: bold;">class</span><span style="color: #2aa198;">...</span> <span style="color: #268bd2;">Ts</span><span style="color: #94BFF3;">&gt;</span> <span style="color: #94BFF3;">(</span>Ts&amp;&amp;<span style="color: #2aa198;">...</span>ts<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">{</span> <span style="color: #dc322f;">(</span>f<span style="color: #859900;">(</span><span style="color: #859900;">std</span>::forward<span style="color: #268bd2;">&lt;</span><span style="color: #268bd2;">Ts</span><span style="color: #268bd2;">&gt;(</span>ts<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>, <span style="color: #2aa198;">...</span><span style="color: #dc322f;">)</span>; <span style="color: #94BFF3;">}</span>,
    <span style="color: #859900;">std</span>::forward<span style="color: #94BFF3;">&lt;</span><span style="color: #268bd2;">Tuple</span><span style="color: #94BFF3;">&gt;(</span>t<span style="color: #94BFF3;">)</span><span style="color: #b58900;">)</span>, f;
<span style="color: #2aa198;">}</span>
</pre>
</div>

<p>
But it gets trickier if we want a binary function over 2 tuples,<br />
or an n-ary function over multiple tuples.
</p>

</section>
</section>
<section>
<section id="slide-orgcc610ba">
<h2 id="orgcc610ba">Another example: for_each on tuples</h2>
<p>
Adapted from fluentcpp.com's <a href="https://www.fluentcpp.com/2019/03/08/stl-algorithms-on-tuples/">"STL algorithms on Tuples"</a>
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple1</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple2</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">F</span>, <span style="color: #859900;">std</span>::<span style="color: #268bd2;">size_t</span><span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">Is</span><span style="color: #2aa198;">&gt;</span>
<span style="color: #268bd2;">F</span> <span style="color: #2aa198;">for_each_impl</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">Tuple1</span>&amp;&amp; <span style="color: #cb4b16;">t1</span>, <span style="color: #268bd2;">Tuple2</span>&amp;&amp; <span style="color: #cb4b16;">t2</span>, <span style="color: #268bd2;">F</span>&amp;&amp; <span style="color: #cb4b16;">f</span>, <span style="color: #859900;">std</span>::<span style="color: #268bd2;">index_sequence</span><span style="color: #b58900;">&lt;</span>Is<span style="color: #2aa198;">...</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
  <span style="color: #b58900; font-weight: bold;">return</span> <span style="color: #b58900;">(</span><span style="color: #859900;">std</span>::invoke<span style="color: #94BFF3;">(</span>f, <span style="color: #859900;">std</span>::get<span style="color: #dc322f;">&lt;</span>Is<span style="color: #dc322f;">&gt;(</span><span style="color: #859900;">std</span>::forward<span style="color: #859900;">&lt;</span><span style="color: #268bd2;">Tuple1</span><span style="color: #859900;">&gt;(</span>t1<span style="color: #859900;">)</span><span style="color: #dc322f;">)</span>,
                         <span style="color: #859900;">std</span>::get<span style="color: #dc322f;">&lt;</span>Is<span style="color: #dc322f;">&gt;(</span><span style="color: #859900;">std</span>::forward<span style="color: #859900;">&lt;</span><span style="color: #268bd2;">Tuple2</span><span style="color: #859900;">&gt;(</span>t2<span style="color: #859900;">)</span><span style="color: #dc322f;">)</span><span style="color: #94BFF3;">)</span>, <span style="color: #2aa198;">...</span><span style="color: #b58900;">)</span>, f;
<span style="color: #2aa198;">}</span>

<span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple1</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">Tuple2</span>, <span style="color: #b58900; font-weight: bold;">class</span> <span style="color: #268bd2;">F</span><span style="color: #2aa198;">&gt;</span>
<span style="color: #b58900; font-weight: bold;">constexpr</span> <span style="color: #b58900; font-weight: bold;">decltype</span><span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">auto</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">for_each</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">Tuple1</span>&amp;&amp; <span style="color: #cb4b16;">t1</span>, <span style="color: #268bd2;">Tuple2</span>&amp;&amp; <span style="color: #cb4b16;">t2</span>, <span style="color: #268bd2;">F</span>&amp;&amp; <span style="color: #cb4b16;">f</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
  <span style="color: #b58900; font-weight: bold;">return</span> for_each_impl<span style="color: #b58900;">(</span><span style="color: #859900;">std</span>::forward<span style="color: #94BFF3;">&lt;</span><span style="color: #268bd2;">Tuple1</span><span style="color: #94BFF3;">&gt;(</span>t1<span style="color: #94BFF3;">)</span>, <span style="color: #859900;">std</span>::forward<span style="color: #94BFF3;">&lt;</span><span style="color: #268bd2;">Tuple2</span><span style="color: #94BFF3;">&gt;(</span>t2<span style="color: #94BFF3;">)</span>,
                       <span style="color: #859900;">std</span>::forward<span style="color: #94BFF3;">&lt;</span><span style="color: #268bd2;">F</span><span style="color: #94BFF3;">&gt;(</span>f<span style="color: #94BFF3;">)</span>,
                       <span style="color: #859900;">std</span>::<span style="color: #268bd2;">make_index_sequence</span><span style="color: #94BFF3;">&lt;</span><span style="color: #859900;">std</span>::<span style="color: #859900;">tuple_size</span><span style="color: #dc322f;">&lt;</span>
                         <span style="color: #859900;">std</span>::<span style="color: #268bd2;">remove_reference_t</span><span style="color: #859900;">&lt;</span><span style="color: #268bd2;">Tuple1</span><span style="color: #859900;">&gt;</span><span style="color: #dc322f;">&gt;</span>::value<span style="color: #94BFF3;">&gt;{}</span><span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>
</pre>
</div>

</section>
</section>
